perf-tests/results/12-12-2025-results.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: loadtest.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 40s max duration (incl. graceful stop):
              * default: 10 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 12762 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  01.0s/10s

running (02.0s), 10/10 VUs, 26207 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  02.0s/10s

running (03.0s), 10/10 VUs, 39840 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  03.0s/10s

running (04.0s), 10/10 VUs, 53420 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  04.0s/10s

running (05.0s), 10/10 VUs, 64346 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  05.0s/10s

running (06.0s), 10/10 VUs, 75224 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  06.0s/10s

running (07.0s), 10/10 VUs, 85619 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  07.0s/10s

running (08.0s), 10/10 VUs, 98682 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  08.0s/10s

running (09.0s), 10/10 VUs, 111270 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  09.0s/10s

running (10.0s), 10/10 VUs, 126160 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  10.0s/10s


  █ TOTAL RESULTS 

    checks_total.......: 252464 25244.642425/s
    checks_succeeded...: 50.00% 126232 out of 252464
    checks_failed......: 50.00% 126232 out of 252464

    ✗ is status 200
      ↳  0% — ✓ 2 / ✗ 126230
    ✗ is status 429
      ↳  99% — ✓ 126230 / ✗ 2

    HTTP
    http_req_duration..............: avg=698.78µs min=136.14µs med=577.57µs max=64.67ms p(90)=1.06ms p(95)=1.32ms
      { expected_response:true }...: avg=3.92ms   min=3.64ms   med=3.92ms   max=4.19ms  p(90)=4.14ms p(95)=4.16ms
    http_req_failed................: 99.99% 126230 out of 126232
    http_reqs......................: 126232 12622.321213/s

    EXECUTION
    iteration_duration.............: avg=783.18µs min=180.1µs  med=652.66µs max=64.75ms p(90)=1.17ms p(95)=1.46ms
    iterations.....................: 126232 12622.321213/s
    vus............................: 10     min=10               max=10
    vus_max........................: 10     min=10               max=10

    NETWORK
    data_received..................: 37 MB  3.7 MB/s
    data_sent......................: 27 MB  2.7 MB/s



running (10.0s), 00/10 VUs, 126232 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  10s